Revit 2024 API
ScheduleDefinition.CategoryId Property
 The category ID of elements appearing in the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId CategoryId { get; }
Visual Basic
Public ReadOnly Property CategoryId As ElementId
	Get
Visual C++
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
Remarks
 Most schedules show elements of a single category. In multi-category schedules, the category ID is InvalidElementId. In key schedules, the schedule's category is the category of elements that the keys are associated with.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace